{
  "basics": {
    "name": "Will Wright",
    "label": "Front End Engineer & Designer",
    "picture": "http://pixel.wright.is/public/img/will.png",
    "email": "will@wright.is",
    "phone": "+44 (0)7922 774469",
    "website": "http://pixel.wright.is",
    "summary": "Edinburgh-based Front End Engineer, with a background in graphic design, with over 15 years of experience, having acquired great knowledge and expertise working alongside award-winning professionals crafting innovative solutions that balance strategy, technology and usability.",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "Edinburgh",
      "countryCode": "UK",
      "region": "Scotland"
    },
    "profiles": [
      {
        "network": "Twitter",
        "username": "@WilliamWright",
        "url": "https://twitter.com/@WilliamWright"
      },
      {
        "network": "LinkedIn",
        "username": "Will Wright",
        "url": "https://uk.linkedin.com/in/wrightwilliam"
      }
    ]
  },
  "work": [
    {
      "company": "Clazzoo.com",
      "position": "Front End Lead Engineer",
      "website": "www.clazzoo.com",
      "startDate": "2016-03-01",
      "endDate": "",
      "summary": "Clazzoo is a cloud based, online booking and business management software as a service system for providers of offline recurring classes.",
      "highlights": [
        "Responsible for the build, design implementation and maintenance of the company's mobile-first web app based on Ruby on Rails, including customer facing interface, provider's dashboard and admin environment."
      ]
    },
    {
      "company": "Flavourly.com",
      "position": "UI Developer & Designer",
      "website": "www.flavourly.com",
      "startDate": "2014-10-01",
      "endDate": "2016-02-29",
      "summary": "As recently featured on the BBC's Dragons Den, receiving 4/5 offers of investment, Flavourly helps consumers discover the best, hard to find, gourmet food and craft beer from independent suppliers via a subscription sampling service. Each month they to match their customers to mouth-watering products and deliver them direct to their desk or door! An online marketplace then makes it super easy to order more of their new favourite products.",
      "highlights": [
        "Redesign and responsive development (HTML, CSS, Javascript, jQuery & Django) of the company's new mobile-first website and eCommerce BrewStore, all of this with usability and a quality user experience as a main focus.",
        "Design of all printed media such as brochures, flyers, promotional materials, packaging and more."
      ]
    },
    {
      "company": "Simple Financial",
      "position": "Web Development Contract",
      "website": "www.simplefs.com",
      "startDate": "2014-07-01",
      "endDate": "2014-09-30",
      "summary": "Simple Financial is a Glasgow based group of 4 companies offering bespoke financial services and guidance to the public.",
      "highlights": [
        "3 month Web Development Contract, being responsible for the redesign and responsive development (HTML, CSS, jQuery) of some of the company's new client-facing websites.",
        "Built a Will Writing web app in Responsive HTML (Bootstrap), CSS, jQuery and AngularJS."
      ]
    },
    {
      "company": "Kork Wines",
      "position": "Co-founder",
      "website": "www.kork.com.br",
      "startDate": "2012-04-02",
      "endDate": "2014-06-30",
      "summary": "Kork Wines was an online retailer of carefully curated wines from small and passionate producers from around the world.",
      "highlights": [
        "Developed the company's business plan securing a venture capitalist investment of £150k.",
        "Participated in several trade shows promoting the company and generating new leads and partnerships.",
        "Sourced products from winemakers all around the world, negotiating over 60 available labels.",
        "Acquired over 3000 sign-ups during the first year of operation.",
        "Designed and built a Magento-based eCommerce website for the company (HTML, PHP, CSS, jQuery)."
      ]
    },
    {
      "company": "Nautillus Design & Strategy",
      "position": "Digital Creative Director",
      "website": "www.nautillus.biz",
      "startDate": "2012-02-03",
      "endDate": "2014-02-28",
      "summary": "Nautillus is a full-service advertising and design agency with a focus on delivering innovative and strategic solutions through an extensive cooperative network of professionals with diverse specialities, allocated on a per project basis.",
      "highlights": [
        "Responsible for digital design, front-end development, social media strategy and display & SEM/PPC campaigns.",
        "Designed and developed the website, marketing campaigns and online presence for the highly publicised São Paulo Mayorship SP2040 project by the University of São Paulo.",
        "Provided extensive training for the SP2040 in-house team on management of the website with over 5k visits/day."
      ]
    },
    {
      "company": "Wrightdesign",
      "position": "Front End Developer & Designer",
      "website": "design.wright.is",
      "startDate": "2009-12-15",
      "endDate": "2012-01-31",
      "summary": "Freelancer in the fields of graphic & digital design and development including websites, print and digital advertising (display and SEM/PPC), branding, brochures, CMS, HTML email newsletters, web analytics reports and more.",
      "highlights": [
        "Designed and developed FIA Business School's websites, social media strategy, marketing campaigns and branding, increasing visits in over 300%.",
        "Attracted high-profile international candidates to all 3 FIA Business School MBA programs, enabling them to successfully recruit for 2 classes per year on each program since 2009."
      ]
    },
    {
      "company": "Extra.com",
      "position": "Digital Creative Director",
      "website": "",
      "startDate": "2008-02-04",
      "endDate": "2009-12-19",
      "summary": "Extra.com is an advertising agency offering an attentive integrated service to local businesses.",
      "highlights": [
        "Coordinated a new digital department within the agency, which I helped create, staff and train.",
        "Developed a politician's marketing strategy and campaign, resulting in him being the third most voted for mayor."
      ]
    },
    {
      "company": "Apple UK",
      "position": "Creative Pro",
      "website": "www.apple.com/uk",
      "startDate": "2007-03-01",
      "endDate": "2007-12-21",
      "summary": "European Operation Centre in London of the American multinational corporation headquartered in California, that designs, develops, and sells consumer electronics, computer software and personal computers.",
      "highlights": [
        "Participated in the launch of the iPhone to the European market.",
        "Delivered customer training on Mac OS X, iOS and creative software."
      ]
    },
    {
      "company": "WG Communication",
      "position": "Art Director",
      "website": "www.wg.com.br",
      "startDate": "2004-12-01",
      "endDate": "2007-01-15",
      "summary": "A medium-sized advertising agency with high-profile clients, in the areas of trading, food and beverages, and publishing.",
      "highlights": [
        "Directed photo shoots and films, creating and designing numerous published adverts published in national circulation magazines, newspapers, posters, television, radio and online advertisements."
      ]
    },
    {
      "company": "W/Brasil (now W/McCann)",
      "position": "Art Direction Intern",
      "website": "",
      "startDate": "2003-06-01",
      "endDate": "2004-12-31",
      "summary": "One of the world's most creative advertising agencies, awarded over 30 Golden Awards at Cannes and other events.",
      "highlights": [
        "6 Month internship creating several published adverts for clients such as AmBev, BR Foods, Redbull and Reebok."
      ]
    },
    {
      "company": "DF Systems (IBM)",
      "position": "Software Development Intern",
      "website": "www.3e.com.br",
      "startDate": "2001-08-01",
      "endDate": "2002-11-30",
      "summary": "IBM in-house systems development for distance learning platforms.",
      "highlights": [
        "Created web-based animations for distance learning programs for the University of São Paulo."
      ]
    }
  ],
  "volunteer": [{
    "organization": "Code Your Future",
    "position": "Mentor",
    "website": "https://codeyourfuture.co",
    "startDate": "2017-02-01",
    "endDate": "",
    "summary": "Code Your Future is the UK's only non-profit organisation supporting refugees with the dream of becoming developers. Students participate in a 6-month programme where, closely support by experienced developers, they learn front and back end development, project-management and working culture, making them full-stack developers as they finish the course.",
    "highlights": [
      "Helping establish the Edinburgh operation following the successful launch of the London based programme.",
      "Supporting the students by giving them feedback on their work and by helping them with problems they might encounter in their assignments."
    ]
  }],
  "education": [
    {
      "institution": "FIA Business School",
      "area": "",
      "studyType": "International MBA",
      "startDate": "2009-02-01",
      "endDate": "2010-12-31",
      "gpa": "4.0",
      "courses": []
    },
    {
      "institution": "University Of The Arts London - Central Saint Martin's School of Art and Design",
      "area": "Communication Design",
      "studyType": "Postgraduate",
      "startDate": "2005-06-01",
      "endDate": "2005-08-01",
      "gpa": "4.0",
      "courses": []
    },
    {
      "institution": "Mackenzie University",
      "area": "Advertising and Marketing",
      "studyType": "Bachelor of Arts",
      "startDate": "2003-06-05",
      "endDate": "2006-12-15",
      "gpa": "4.0",
      "courses": []
    },
    {
      "institution": "Mackenzie University",
      "area": "Electronic Engineering",
      "studyType": "Undergraduate studies",
      "startDate": "2000-01-05",
      "endDate": "2003-12-15",
      "gpa": "",
      "courses": []
    },
    {
      "institution": "Miguel de Cervantes (Spanish)",
      "area": "",
      "studyType": "Secondary School",
      "startDate": "1994-07-05",
      "endDate": "1999-12-20",
      "gpa": "",
      "courses": []
    },
    {
      "institution": "St. Paul's School (British)",
      "area": "",
      "studyType": "Primary School",
      "startDate": "1985-01-15",
      "endDate": "1994-05-31",
      "gpa": "",
      "courses": []
    }
  ],
  "awards": [],
  "publications": [
    {
      "name": "Portraits of India: the scenes, the people, the beauty",
      "publisher": "Blurb",
      "releaseDate": "2012-07-12",
      "website": "http://will.wright.is/india",
      "summary": "Traveling the world, Will began to observe the relationships people keep between them and the rest of the world. He believes we are all global citizens and it is through photography that he tries to document how people so distant can be so similar to you and me. This book focuses on some of his portraits taken in the streets of India."
    }
  ],
  "skills": [
    {
      "name": "Web Development",
      "level": "",
      "keywords": [
        "Ruby",
        "Ruby on Rails",
        "Javascript",
        "HTML5",
        "CSS3/SASS",
        "Django",
        "React",
        "jQuery",
        "Meteor",
        "Bootstrap",
        "Git",
        "Responsive Development",
        "e-Commerce"
      ]
    },
    {
      "name": "Digital & Graphic Design",
      "level": "",
      "keywords": [
        "Art & Creative Direction",
        "Responsive Design",
        "Email Marketing",
        "Social Media Marketing",
        "Display & SEM/PPC (Google Adwords)",
        "Digital & Film Photography",
        "Studio Lighting",
        "Laboratory film processing",
        "Digital post-processing"
      ]
    },
    {
      "name": "Other Skills",
      "level": "",
      "keywords": [
        "Adobe Illustrator",
        "Adobe Indesign",
        "Adobe Lightroom",
        "Adobe Photoshop",
        "Apple Aperture",
        "Bash/ZSH",
        "CodeKit",
        "Microsoft Office",
        "QuarkXpress",
        "Sketch",
        "Sublime Text",
        "Transmit",
        "TypeKit",
        "UNIX",
        "VIM"
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Native speaker"
    },
    {
      "language": "Portuguese",
      "fluency": "Native speaker"
    },
    {
      "language": "Spanish",
      "fluency": "Fluent (Bachiller Diploma)"
    }
  ],
  "interests": [
    {
      "name": "Photography",
      "keywords": [
        "Film photography",
        "Street photography"
      ]
    },
    {
      "name": "Outdoors",
      "keywords": [
        "Bouldering",
        "Rock climbing",
        "Mountaineering",
        "Hiking"
      ]
    }
  ],
  "references": [
    {
      "name": "Pedro Menezes, Senior Creative Director at Quaderno",
      "reference": "Technology + Creativity + Design... Will's work represents the sum of these skills, but the result is much more than the sum of each part... I highly recommend Will."
    },
    {
      "name": "Fabio Machado, Owner at Global Link Consulting",
      "reference": "Will has a broad and global experience for management. Having him as a classmate during our MBA was a fantastic experience. His neat vision and quick wit added great value for all of us! I highly recommend him as a professional."
    },
    {
      "name": "Alfredo Behrens, Professor, Cross-Cultural Management at FIA Business School, International MBA",
      "reference": "Will Wright is an exceptionally talented young professional. Besides very well trained, he is deeply perceptive, responsible and supportive. His design recommendations I follow much to my delight. He should fully flourish in any business environment where an artistic bent is cherished."
    },
    {
      "name": "Arthur Wong, Marketing Manager, PR and Club Management at Ducati Motor Holding",
      "reference": "Will brings together two very interesting traits based on his multicultural upbringing. His keen and trendy creativity shows his Brazilian DNA with a much-focused mindset on objectives. On his heritage, his British organisation counterparts in a very positive manner usually unseen in his line of work. By aggregating these traits makes him a differentiated professional that focuses in the established objectives."
    }
  ]
}
